#include	"ach2.h"

//------------------------------------------------------------------------------
//
//------------------------------------------------------------------------------
ACH2::ACH2(QObject *parent) : Vehicle(parent)
  , battery(Q_NULLPTR)
  , Ucc(0.0)
  , Icc(0.0)
  , fuel_tank(Q_NULLPTR)
  , fuel_pump(Q_NULLPTR)
  , oil_pump(Q_NULLPTR)
  , fuel_pump_K11(Q_NULLPTR)
  , disel_stop_A13(Q_NULLPTR)
{

}

//------------------------------------------------------------------------------
//
//------------------------------------------------------------------------------
ACH2::~ACH2()
{

}

//------------------------------------------------------------------------------
//
//------------------------------------------------------------------------------
void ACH2::initialization()
{
    initControlCircuit();

    initFuelSystem();

    initDisel();

    initSounds();
}

//------------------------------------------------------------------------------
//
//------------------------------------------------------------------------------
void ACH2::step(double t, double dt)
{
    // Работа цепей управления
    stepControlCircuit(t, dt);

    // Работа топливной системы
    stepFuelSystem(t, dt);

    // Работа дизеля
    stepDisel(t, dt);

    // Вывод сигналов в кабину и внешнюю модель
    stepSignalsOutput(t, dt);
}

GET_VEHICLE(ACH2)
